#### LeaderEndPosition Property

---

|  |
| --- |
| DimensionSegment Class   See Also |

The position of the dimension leader end point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015 Subscription Update.

# Syntax

| C# |
| --- |
| ``` public XYZ LeaderEndPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LeaderEndPosition As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ LeaderEndPosition { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

This property is not applicable to all dimensions. For example, it is not available for spot dimensions, dimensions using equality formula, and when dimension style is ordinate.

If the position is not applicable, this property returns NULL and will not allow setting a value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ApplicationException | Thrown when the dimension text is unavailable. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when:  * The dimension text is a SpotElevation * When using equality formula. * When dimension style is ordinate. |

# See Also

DimensionSegment Class

Autodesk.Revit.DB Namespace